---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.CannotUseCurvesForFaceSplit
source: html/7bd8dda8-92d3-bf78-ff59-675025a2f47c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FaceSplitterFailures.CannotUseCurvesForFaceSplit Property

The sketch cannot split the face of the highlighted element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUseCurvesForFaceSplit { get; }
```